{
    "version": "https://jsonfeed.org/version/1",
    "title": "Making Tracks",
    "description": "",
    "home_page_url": "https://makingtracks.ah-web.org",
    "feed_url": "https://makingtracks.ah-web.org/feed.json",
    "user_comment": "",
    "author": {
        "name": "Alex"
    },
    "items": [
        {
            "id": "https://makingtracks.ah-web.org/project-pendolino-part-ii-some-more-testing/",
            "url": "https://makingtracks.ah-web.org/project-pendolino-part-ii-some-more-testing/",
            "title": "Project Pendolino, Part II: Some More Testing",
            "summary": "\n  <p>\n    In the <a href=\"https://makingtracks.ah-web.org/project-pendolino-part-i-lets-get-it-moving-shall-we/\" target=\"_blank\">previous instalment</a> of this series, it was all about getting the model moving. It didn't pan out perfectly, but it was a start - and a good opportunity to get a look at the model's internals. Now I need to figure out a way forward from there. The next step will be to replace the decoder.\n  </p>\n",
            "content_html": "\n  <p>\n    In the <a href=\"https://makingtracks.ah-web.org/project-pendolino-part-i-lets-get-it-moving-shall-we/\" target=\"_blank\">previous instalment</a> of this series, it was all about getting the model moving. It didn't pan out perfectly, but it was a start - and a good opportunity to get a look at the model's internals. Now I need to figure out a way forward from there. The next step will be to replace the decoder.\n  </p>\n\n\n  <p>\n    The interior of the model is actually quite nicely constructed. It's easy to disassemble and neatly organised.&nbsp;The current decoder is hardwired into the model, by way of a small piece of PCB that acts as a connector between the motor and chassis, which are using Fleischmann's FMZ wire colour scheme, and the TWIN decoder which has DCC wire colours. A plastic cover hides the wires between the rows of seats. When I replace the decoder, I will need to rewire parts of the model as well. I may even try to use consistent wire colours as much as feasible.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7714.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7714-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>The model's interior, with a plastic cover between the seats...</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7716.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7716-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>... which hides the wires nicely</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7706.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7706-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>The decoder sits in a cutout between the seats</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    While my original thought had been to wire in an 8-pin socket and use a corresponding decoder, I have since moved away from that idea. This has several reasons. One is that I have a fairly strong dislike against 8-pin decoders; their wiring harnesses tend to require shortening, and they often have additional dangling wires which are difficult to tame without either additional soldering or other stunts. The other is that I can't find an 8-pin socket or breakout board that will reasonably fit into the model without being overly noticeable from the outside.\n  </p>\n\n  <p>\n    The old decoder sits on a cutout between the seats, which is approximately the same size as the chip - 26x11mm. Something I can fit there quite nicely is a Next18 connector - several options with very nice fits are available. The advantage of using Next18 is that decoders tend to be smaller than 21MTC or PluX versions - they are normally intended for TT and N scale models. This comes with a drawback: those scales tend to have a lower power draw than H0. So many of the available decoders - and most of the ones I would consider - are limited to 0.7A for the motor. That is a bit less than the Fleischmann decoder, which is specced for 0.8A motor current. Decoders with a lower spec are therefore risky. I can get decoders with a higher motor current limit - but I have to import them from Europe. So that part will take a while.\n  </p>\n\n  <p>\n    And before I took the plunge on that, I wanted to get at least an idea if a new decoder could improve the model's driving characteristics, or if I would have to think along different lines. I still have some LaisDCC decoders sitting around - they're TCS knock-offs, and don't have particularly good motor control. In previous usage scenariosm they also had some funky issues around lighting. I have no intention of ever again using them operationally, but I figured one of them would be good enough for testing. So with some careful soldering, I removed the old Fleischmann decoder and wired it in.&nbsp;\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7747.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/67/gallery/IMG_7747-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>This is what a decommissioned Fleischmann TWIN decoder looks like</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    The subsequent driving test gave a better result than expected. The model drives quite smoothly at higher speeds, accelerates and decelerates nicely. There are some issues at low speeds, they could be related either to power pickup or the choke coil, but I also don't expect the Lais to have particularly fine motor control on ye olde Fleischmann pancake motor - a German make is more likely to handle these motors well, and I might even be able to find recommendations for the best settings.\n  </p>\n\n  <p>\n    But now I have more certainty about the next step, and can go about procuring the required materials. This will take time, so just watch this space. In the meantime, here is a short clip of the Pendolino tilting through a curve.\n  </p>\n<div><div class=\"post__iframe\"><iframe loading=\"lazy\" title=\"Pendolino 1\" width=\"560\" height=\"315\" src=\"https://makertube.net/videos/embed/hBWPPu1S94SoymH6DDdhyw\" frameborder=\"0\" allowfullscreen=\"\" sandbox=\"allow-same-origin allow-scripts allow-popups allow-forms\"></iframe></div>\n</div>",
            "image": "https://makingtracks.ah-web.org/media/posts/67/IMG_7740.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-03-30T17:15:00+10:00",
            "date_modified": "2025-03-30T17:26:50+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/project-pendolino-part-i-lets-get-it-moving-shall-we/",
            "url": "https://makingtracks.ah-web.org/project-pendolino-part-i-lets-get-it-moving-shall-we/",
            "title": "Project Pendolino, Part I: Let&#x27;s get it moving, shall we?",
            "summary": "\n  <p>\n    This Fleischmann BR 610 really is a lovely model. It looks gorgeous, is nicely detailed, the print quality is near flawless, and the idea of an actual tilting mechanic is great, even if it is not exactly prototypical. But, alas, looks aren't everything, especially when it comes to a second hand acquisition.\n  </p>\n",
            "content_html": "\n  <p>\n    This Fleischmann BR 610 really is a lovely model. It looks gorgeous, is nicely detailed, the print quality is near flawless, and the idea of an actual tilting mechanic is great, even if it is not exactly prototypical. But, alas, looks aren't everything, especially when it comes to a second hand acquisition.\n  </p>\n\n\n  <p>\n    The first thing most railway modellers will do with a new model is put it on the track and see if/how it runs. I am no exception myself. After verifying the nature of the decoder and its configuration, on the track it went. And that didn't go overly well - though I had kind of expected this.\n  </p>\n\n  <p>\n    Fleischmann models have a reputation of being solid and long-lived. Lots of modellers love them, and they have pretty good resale value. But they also have some idiosyncrasies that may scare off less experienced modellers - they certainly made me hesitate to buy Fleischmann so far.\n  </p>\n\n  <p>\n    One of these characteristics is that they can be a bit problematic to digitalise. Fleischmann used a type of motor that sits upright in the model, usually driving only one bogie directly. This type is often referred to as 'pancake motor'. They are, in theory, easy to maintain because they can be fully disassembled and are not encapsulated. The motor internals are covered by a removable shield which also carries most of the wire connections. In older motors, this shield is made of metal, in newer ones it is a kind of PCB.\n  </p>\n\n  <p>\n    In many pre-digital Fleischmann models, one motor pole is directly connected to the chassis and rail. This connection has to be severed before a digital decoder is fitted, otherwise the decoder will suffer irreparable damage. Depending on the age of the motor, this can be as simple as severing a specific connection on the PCB shield. If the shield is metal, it often has to be replaced. As time goes by, spare parts are becoming harder to obtain.\n  </p>\n\n  <p>\n    Since my model is already digital, this was not a problem. However, its running characteristics were pretty poor. It appeared to struggle with power pickup and ran very haltingly on my test track. On my ECoS-driven layout, it did not move a millimetre. Also, the lights did not appear to work at all. So, it was time to take a look under the hood.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7701.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7701-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Ye olde Fleischmann pancake motor</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    The above photo shows the motor with its removable shield. The two brass caps cover the spring loaded carbon brushes. Removing the shield is only possible after first removing the bogie from the chassis, then removing the plastic bogie cover. Once the shield is removed, the copper rotor and wire windings are visible.\n  </p>\n\n  <p>\n    The rotor and coal brushes appear to be common problem sources if not maintained for a long time, if search results on relevant forums are anything to go by. The brushes can get oily, the rotor really mucky. Both hinder the smooth running of the motor. My exemplar didn't appear to be too bad. the brushes themselves were dry, and the rotor had some dirt on it, which was cleaned off quickly. After a reassembly and some gearbox lubricant the model ran better, but still not well - it's noisy and runs haltingly. And still not a peep when it was sitting on the layout.&nbsp;\n  </p>\n\n  <p>\n    As a next step I cleaned all wheels and power pickups as well as I could, which again brought some improvement, but I wasn't yet satisfied. As for the other issues, some research was in order. This gave me some ideas for what to do next.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7704.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7704-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>The motor, from a slightly different angle</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7711.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7711-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>The gearbox on the other side of the motor mount</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7713.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/66/gallery/IMG_7713-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Axles are driven directly by way of these gears</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    In the photos of the motor, the wire colours can be seen to be different from the DCC standard. They correspond to Fleischmann's FMZ norm, not DCC. Therefore, blue and black are the rail connections, red and violet the motor connections (with blue also being the common return), and the light/dark brown wires are the + for the lights. The small PCB visible on the left is the handoff point for the decoder, which actually uses the DCC colour scheme.\n  </p>\n\n  <p>\n    The photo also shows something that looks like a resistor, between the violet wire and the motor. Research has revealed that this is not a resistor, but a choke coil which serves to suppress electromagnetic interference from the motor. These parts can sometimes cause issues with digital operation. I was also told that there should be one of these coils on each motor connection, but there is only one in mine. If I look closely at the connection of the lower red wire on the motor shield, it seems like something might have been de- and resoldered there. I'll probably never know for sure.\n  </p>\n\n  <p>\n    By fluke, I figured out why the model wasn't responding at all to commands from my ECoS central: RailCom. Apparently, some older decoders don't like the RailCom cutout in the digital signal. The moment I turned off RailCom in my ECoS, the model responded.\n  </p>\n\n  <p>\n    That's not a solution though - I like RailCom and RailCom+. It makes my life easier. So a decoder that has problems with RailCom can't stay. My next step with this model is therefore to replace the decoder. I'm also contemplating to install an 8-pin plug instead of hardwiring the decoder into the model. It may take me some time to acquire the necessary bits, and the next episode of Project Pendolino will cover the decoder change and its results. The lights will be a topic for later - I'll focus on running optimisation first.\n  </p>",
            "image": "https://makingtracks.ah-web.org/media/posts/66/IMG_7692.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-03-18T11:00:00+10:00",
            "date_modified": "2025-03-18T11:12:40+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/project-pendolino-beginnings/",
            "url": "https://makingtracks.ah-web.org/project-pendolino-beginnings/",
            "title": "Project Pendolino: Beginnings",
            "summary": "\n  <p>\n    Say wat you want about my impulse control - or lack thereof: some opportunities are just too good to walk past. Certain models fall under that category, especially when the price is attractive.\n  </p>\n",
            "content_html": "\n  <p>\n    Say wat you want about my impulse control - or lack thereof: some opportunities are just too good to walk past. Certain models fall under that category, especially when the price is attractive.\n  </p>\n\n\n  <p>\n    Like this model of a BR 610 Diesel multiple unit of Deutsche Bahn. I have a weakness for diesel railcar models, and something in the traffic red DB livery of the late 1990s had long tickled my fancy. Such models are rare here in Australia, so when one cropped up on a well known online platform, I kept an eye on it. Initially higher asking prices found no takers, and eventually the price dropped to a level that was perfectly palatable for me.\n  </p>\n\n  <p>\n    The BR 610 was commissioned by Deutsche Bahn in the late 1980s, to service a regional network of fast trains. For this purpose, the trains were equipped with hydraulic tilting technology, to allow for faster travel through curves, without reducing passenger comfort. While vehicle structure and traction were provided by German suppliers, the bogies and tilting technology came from Fiat's railway subsidiary Fiat Ferroviaria, who had been successfully equipping Italian trains with said tech since the 1970s. The system carried the brand name 'Pendolino', which by extension became the 610s nickname.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"1\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/65/gallery/610013_DB_Cheb.jpg\" data-size=\"1024x725\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/65/gallery/610013_DB_Cheb-thumbnail.jpg\" height=\"510\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>A Deutsche Bahn BR 610 in a livery similar to my model (From Actuell37 - Eigenes Werk, CC BY-SA 4.0, https://commons.wikimedia.org/w/index.php?curid=47478215</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    20 dual units were delivered by 1992, and stayed in service until 2014, by which time they had travelled a collective 100 million kilometres. For all intents and purposes, this prototype was a success. Ironically, the successor model BR 611, which according to requests from Deutsche Bahn had to be fully produced in Germany, was never as reliable as the 610, and even the succeeding BR 612 had issues for a long time.\n  </p>\n\n  <p>\n    Models of the BR 610 in H0 scale were produced by Fleischmann from 1994 to about 2003, who made 2-rail/DC versions under their own brand, and 3-rail/AC versions for Märklin. Later versions were equipped with digital decoders, initially for Fleischmann's DCC predecessor FMZ, but then also with TWIN decoders which worked on both FMZ and DCC systems.<br>\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/65/gallery/IMG_7692.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/65/gallery/IMG_7692-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/65/gallery/IMG_7695.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/65/gallery/IMG_7695-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/65/gallery/IMG_7693.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/65/gallery/IMG_7693-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n  <p>\n    The model I acquired is a version with TWIN decoder, so it would have been made between 2001 and 2003. It is an absolutely gorgeous model, and the exterior condition of the second hand exemplar is impeccable. The decoder reads and writes fine under DCC.&nbsp;The bit that really appealed to me about this model was that it is one of the few that has an actual tilting mechanic implemented. Given its age, it is obviously not a very fancy implementation - more of a mechanical property of the cab-side bogies on each car that cause the body to tilt slightly when passing through a curve. That's not overly prototypical, since the tilting is normally speed-dependent and would not happen at slow speeds. But it's enough of a curio to make this model really interesting.\n  </p>\n\n  <p>\n    However, it will need some TLC. A first driving test was unsuccessful. The motor starts haltingly and does not move the vehicle very well. Also, there appears to be no light function. I have only just received the model, so I have not yet been able to look at things any more closely. It is clear that there are a number of things to address, and a number of possible solutions to different problems. So this will become a loose series of articles, as I examine the model more closely with the objective to make it fully functional.\n  </p>",
            "image": "https://makingtracks.ah-web.org/media/posts/65/IMG_7696.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-03-16T16:15:00+10:00",
            "date_modified": "2025-03-16T16:23:22+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/train-portraits-the-intermodal/",
            "url": "https://makingtracks.ah-web.org/train-portraits-the-intermodal/",
            "title": "Train Portraits: The Intermodal",
            "summary": "\n  <p>\n    Intermodal traffic is pretty big in Australia, and has a long history. While rail freight is dominated by bulk goods such as ore, coal and grain, container traffic is a not insignificant part of Australia's rail transport. Rail corridors between major cities are frequented by container trains, adding up to hundreds of thousands of tons each month.\n  </p>\n",
            "content_html": "\n  <p>\n    Intermodal traffic is pretty big in Australia, and has a long history. While rail freight is dominated by bulk goods such as ore, coal and grain, container traffic is a not insignificant part of Australia's rail transport. Rail corridors between major cities are frequented by container trains, adding up to hundreds of thousands of tons each month.\n  </p>\n\n\n  <p>\n    I'd had the idea of building a small container train for some time. As with any other freight train in Australia, container trains are long, and prototypical lengths are just not feasible for me, neither in terms of space nor budget. So instead of 2-4 locos and dozens of carriages, this train will have to make do with one loco and six carriages.\n  </p>\n\n    <h2 id=\"motive-power\">\n      Motive Power\n    </h2>\n\n  <p>\n    The locomotive for this train is none other than my NR52 \"Kungara Mankurpa' in indigenous livery. I have <a href=\"https://makingtracks.ah-web.org/a-look-at-the-sds-models-nr-class-nr52-kungara-mankurpa/\">introduced this locomotive</a> at length in a dedicated post. Despite the described flaws, this model has become one of my absolute favourites. The driving characteristics are rock solid, and it's a feast for the eyes to watch the loco go around the track.\n  </p>\n\n  <p>\n    NR locos are very versatile in real life. They pull world-famous experience trains like The Ghan and Indian Pacific, and perform freight duties across the entire spectrum. With nearly 120 of the prototype in service, they can be seen in almost every state and territory in Australia. So in more ways than one, the NR is the perfect loco for a container train.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/img_3669.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/img_3669-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n    <h2 id=\"rolling-stock-and-loads\">\n      Rolling Stock and Loads\n    </h2>\n\n  <p>\n    The rolling stock for this train consists of two sets of 63 foot container wagons, coded RQTY. Historically, these wagons go back to the FQX design which was jointly created by Victorian Railways and South Australian Railways in the late 1960s. Later, the South Australian FQX stock went to National Rail, where it was rebuilt with the objective to reduce weight, and recoded RQTY. Part of the RQTY stock was used by the SeaTrain division running trains between New South Wales and Queensland.\n  </p>\n\n  <p>\n    These models also come from SDS models, and they've done a great job on them. Thanks to a die-cast spine they have sufficient weight to provide wobble-free driving characteristics even on non-perfect track.\n  </p>\n\n  <p>\n    When National Rail was privatised and renamed Pacific National in the early 2000s, the RQTY stock as well as the NR fleet became part of Pacific National as well. Half of my RQTY models are in National Rail SeaTrain colours (blue and orange), while the others are Pacific National grey and yellow.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"2\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_5601.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_5601-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>RQTY in National Rail SeaTrain 'Blue and Marigold'...</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_5594.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_5594-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>... and in Pacific National Yellow and grey.</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_5603.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_5603-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Both variants lashed up</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    RQTY wagons can carry three 20ft containers, or one 40ft and 20ft container each. When looking at real life container trains, they are not always fully loaded. At times, there's only one or two containers on a wagon. I contemplated doing that with my train as well, but decided that with only six wagons, I might as well get a full load. Also, real trains are not always made up of the same type of container wagon. Again, for the sake of simplicity I did not go down that particular rabbit hole. But the option is there, should the mood strike me.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7410.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7410-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Different</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7409.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7409-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Loading</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7408.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7408-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Options</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7407.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7407-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>for</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7406.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7406-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>63ft container flats</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    With the rolling stock sorted, it was time to think about the loads. Some time ago, On Track Models started producing models of curtain-sided containers, a container type which, according to their website, has been in use since the late 1980s and is still in use today. These 40ft containers carry all kinds of different liveries, from corporate paint jobs to advertising motifs. The latter struck my fancy, with advertising for Australian staples like Vegemite.&nbsp;The gaps are filled by a bunch of 20ft container models in a few variations.&nbsp;<br>\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7383.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7383-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Curtain sided containers with Vegemite...</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7398.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7398-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Peanut butter...</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7399.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7399-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>and detergent motifs</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7402.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7402-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>Regular 210ft container</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7401.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7401-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>20ft container with roof hatch</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7400.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7400-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>20ft container with side doors</figcaption>\n    </figure>\n    </div>\n  </div>\n\n  <p>\n    To avoid having to glue containers to the wagons, the wagons have a nifty feature. There are small holes on the deck, in which tiny pins can be inserted. The containers have corresponding holes and sit on top of those pins, which hold them in place. This also makes it possible to change the loads as desired, if one has more containers than space on the train.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7380.jpg\" data-size=\"2268x4032\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/64/gallery/IMG_7380-thumbnail.jpg\" height=\"1280\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n    <h2 id=\"plausibility\">\n      Plausibility\n    </h2>\n\n  <p>\n    This train fits into the fairly narrow time window between the dissolution of National Rail into Pacific National in 2002, and the repaint of NR 52 circa 2007. It is absolutely not uncommon for Australian railway companies to continue running locomotives and rolling stock in liveries and signage of their predecessors. Aurizon still run locomotives in Queensland Rail livery from over 30 years ago. They're not usually in a hurry to repaint all their rolling stock.&nbsp;\n  </p>\n\n  <p>\n    So it's very plausible that a container train may at some time have partially consisted of RQTY wagons in different liveries, hauled by an NR locomotive still carrying National Rail signage. While I am not sure whether the curtain side container motifs fit into that time window, I was at least able to ascertain that, according to photographic evidence available on the net, the lone Maersk container is not completely out of place.<br>\n  </p>\n<div><div class=\"post__iframe\"><iframe loading=\"lazy\" title=\"NR52 with a fully loaded container train - Model Railway\" width=\"560\" height=\"315\" src=\"https://makertube.net/videos/embed/0c92a738-ab5e-475e-9f0d-d6d760d71c09\" frameborder=\"0\" allowfullscreen=\"\" sandbox=\"allow-same-origin allow-scripts allow-popups allow-forms\"></iframe></div>\n</div>",
            "image": "https://makingtracks.ah-web.org/media/posts/64/IMG_7381.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-02-22T20:14:00+10:00",
            "date_modified": "2025-03-16T16:23:01+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/train-portraits-the-banana-transport/",
            "url": "https://makingtracks.ah-web.org/train-portraits-the-banana-transport/",
            "title": "Train Portraits: The Banana Transport",
            "summary": "\n  <p>\n    Whatever is happening on my layout does not necessarily bear resemblance to reality. The fact alone that I run trains from two different continents should make clear that this is not an attempt at modelling a specific place at a specific time. The key motto is: If it's fun, it'll run. My railway, my rules.\n  </p>\n",
            "content_html": "\n  <p>\n    Whatever is happening on my layout does not necessarily bear resemblance to reality. The fact alone that I run trains from two different continents should make clear that this is not an attempt at modelling a specific place at a specific time. The key motto is: If it's fun, it'll run. My railway, my rules.\n  </p>\n\n\n  <p>\n    But that doesn't mean there's complete chaos. The trains overall such may be from different eras and countries, but I try to have trains that are, by themselves, at least plausible in their composition of locomotive and rolling stock. At the very least they should match, and fit into their respective era.&nbsp;\n  </p>\n\n  <p>\n    Depending on train type, there may be some allowances that need to be made. This train is a good example. Prototypical Australian freight trains are beyond my budget and space, as they normally consist of multiple locomotives and several dozen cars. So there's a need to put together a shortened version, and that leaves room for some creative license.\n  </p>\n\n  <p>\n    This train is built around the NLBX wagons, a class of New South Wales Louvre van specifically used for transporting bananas from the New South Wales North Coast, in the service of the Banana Growers Federation.\n  </p>\n\n    <h2 id=\"locomotive\">\n      Locomotive\n    </h2>\n\n  <p>\n    The motive power for this train is the New South Wales 81 Class diesel locomotive, a type built for the State Rail Authority between 1982 and 1991. This is the most powerful diesel locomotive built for an Australian state operator, and operated a wide variety of passenger and freight trains across four states (New South Wales, Queensland, Victoria and South Australia).\n  </p>\n\n  <p>\n    The model was produced by SDS Models and is sporting the <a href=\"https://australianlocomotiverosters.blogspot.com/2020/08/candy-livery.html\" target=\"_blank\">'Candy' livery</a> of the State Rail Authority, which was prevalent on locomotives and rolling stock from 1982 to around 1992 when the SRA was restructured. The model is of a lovely quality, nicely detailed and comes with impressive sound.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_6852.jpg\" data-size=\"2900x1632\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_6852-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n    <h2 id=\"rolling-stock\">\n      Rolling Stock\n    </h2>\n\n  <p>\n    From 1987, some 60-odd regular louvre vans were converted for the transport of fruit, and placed in service with the Banana Grower's Federation, where they were used to transport bananas from the New South Wales North Coast to the target markets. The conversion included interior lining as well as exterior decorations. They were classed as NLBF and NLBX, based on what class of wagon they were converted from.&nbsp;While there is relatively little source material to be found on the web, the official wording is that these vans travelled between the North Coast and Sydney. However, credible word of mouth has it that these were seen as far south as Victoria, and as far north as South East Queensland.\n  </p>\n\n  <p>\n    The banana vans had a fairly short service life and were fully withdrawn by 1992.&nbsp; they were remarkable enough for On Track Models to produce several sets to date. Their range covers both NLBF and NLBX types in various colours and decorations. Most remarkable is their second run of blue weathered NLBX vans, where every single one looks a bit different. The below gallery shows two full sets, with different patterns of the yellow lines (which on some vans is even different on each side), as well as varying decorations.<br>\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5537.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5537-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5538.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5538-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5539.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5539-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5540.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5540-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5541.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5541-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5542.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/img_5542-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n  <p>\n    In this year's third run, On Track Models produced one set each of NLBF vans in red and grey, as well as one set of NLBX vans in red. While these all look the same aside from the numbers, they provide sufficient variety to add to the train.\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"1\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://makingtracks.ah-web.org/media/posts/63/gallery/IMG_7584.jpg\" data-size=\"4032x2268\">\n        <img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/63/gallery/IMG_7584-thumbnail.jpg\" height=\"405\" width=\"720\" alt=\"\" >\n      </a>\n      <figcaption>One of the red NLBX wagons - they all look the same</figcaption>\n    </figure>\n    </div>\n  </div>\n\n    <h2 id=\"plausibility\">\n      Plausibility\n    </h2>\n\n  <p>\n    The NLBX/NLBF vans would not have run as a single train, but integrated into manifest freight trains among other freight. Little source material exists on how these trains were composed, Those trains were generally longer than 8-9 vans as well. In that respect, this train is certainly on the low end of the plausibility scale, but that's where the fun aspect comes in - I really like the optics of these vans.\n  </p>\n\n  <p>\n    The 81 Class in Candy livery falls squarely into the service period of these vans, and given its range of operations, it's very likely that a train containing NLBX vans was hauled by one or more 81s.\n  </p>\n\n  <p>\n    And here's what it looks like:\n  </p>\n<div><div class=\"post__iframe\"><iframe loading=\"lazy\" title=\"Banana Train - new and improved\" width=\"560\" height=\"315\" src=\"https://makertube.net/videos/embed/e1d9fdc2-09be-4c3a-ba7a-ba2d0fac7835\" frameborder=\"0\" allowfullscreen=\"\" sandbox=\"allow-same-origin allow-scripts allow-popups allow-forms\"></iframe></div></div>\n\n  <p>\n    More train portraits coming soon. Stay tuned!\n  </p>",
            "image": "https://makingtracks.ah-web.org/media/posts/63/IMG_7584.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-02-01T22:00:00+10:00",
            "date_modified": "2025-03-16T16:22:49+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/fun-with-relays/",
            "url": "https://makingtracks.ah-web.org/fun-with-relays/",
            "title": "Fun with Relays",
            "summary": "<p><!-- wp:paragraph --></p>\n<p>In the pursuit of being able to control as many things as possible digitally, while keeping effort to a minimum, I went down the rabbit hole of controlling some of the scenic accessories via DCC. Currently I have two buildings with functions that I want to turn off and on at will: a lighthouse, and a windmill.</p>\n",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>In the pursuit of being able to control as many things as possible digitally, while keeping effort to a minimum, I went down the rabbit hole of controlling some of the scenic accessories via DCC. Currently I have two buildings with functions that I want to turn off and on at will: a lighthouse, and a windmill.</p>\n\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The windmill came with a motor specifically operating on 16V AC. In anticipation of this, I built a 16V AC wire bus under my layout quite some time ago. That came in handy when the lighthouse was built, since it is capable of operating on that same voltage.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>To control any accessories I intended to use the same <a href=\"https://makingtracks.ah-web.org/point-motor-shoot-out-servo-and-volley/\">MarDec devices</a> which I am using to control servos: Arduino-based accessory decoders with high flexibility. Out of the box MarDec supports servo control as well as a number of ways to control other accessories, including steady power, flashing lights and similar. However, using the output of these devices to power accessories directly is only suitable for things that work with 5V and draw low amperage. For anything else, additional work is required. When you do a bit of research, you'll hear talk about Mosfet switches, transistors or relays. What you end up using is - largely - up to your confidence with electronics and appetite for complexity.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>I quickly decided to go with relays. The other options don't readily offer themselves for use with AC, as far as I was able to determine with my limited electronics knowledge. Relays are quite simple to wire in, all they need is a power source and a signal, and then they pass through whatever is connected to the right contacts (within their specs, of course). How that's done with the windmill is shown in the below graphic.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":1339,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/7/gallery/relay_accessories.png\" data-size=\"1070x828\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/7/gallery/relay_accessories-thumbnail.png\" alt=\"\" width=\"720\" height=\"557\"></a></figure>\n</div></div>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>The 16V AC are connected to the common and the Normally Open (NO) connector. A proper DC power supply is connected to DC+ and DC- connectors - in my case that's 5V, but these relays are available for different operating voltages. Lastly, one of the Mardec ports is connected to the IN connector, and the port is configured to provide a single steady signal when activated, which happens through a DCC accessory address. On activation, the relay is triggered and the 16V AC flows through to the motor in the windmill - or any other accessory wired this way.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>What I learned about relays has also come in helpful for another small project I'm working on. But that will be subject of a separate post. In the meantime, I'll just show off the two buildings that I can now control with relays. Stay tuned.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:video {\"autoplay\":true,\"id\":1379} --></p>\n<figure class=\"wp-block-video\">\n<table style=\"border-collapse: collapse; width: 100%; border-style: none;\" border=\"0\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"348\" height=\"196\" style=\"width: 348px; height: 196px;\" title=\"Windmill\" src=\"https://makertube.net/videos/embed/56822c6d-7001-4a11-9c18-e5f86fa7bdff\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" sandbox=\"allow-same-origin allow-scripts allow-popups allow-forms\"></iframe></div></td>\n<td style=\"width: 49.9288%;\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"348\" height=\"196\" style=\"width: 348px; height: 196px;\" title=\"Lighthouse\" src=\"https://makertube.net/videos/embed/ca1349c0-3108-4ff8-ba4b-368bfa4c4ef4\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" sandbox=\"allow-same-origin allow-scripts allow-popups allow-forms\"></iframe></div></td>\n</tr>\n</tbody>\n</table>\n</figure>\n<p><!-- /wp:video --></p>",
            "image": "https://makingtracks.ah-web.org/media/posts/7/Screenshot-2025-01-25-211800.png",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-01-25T21:17:00+10:00",
            "date_modified": "2025-01-25T21:26:19+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/some-things-are-worth-collecting/",
            "url": "https://makingtracks.ah-web.org/some-things-are-worth-collecting/",
            "title": "Some things are worth collecting",
            "summary": "<p><!-- wp:paragraph --></p>\n<p>It has been five years since, in a quest to assemble a specific train, I acquired a model of an East German dining car in the then typical red Mitropa livery. At the time, I didn't really know what I had bought - only that the model had been produced in the GDR. But I was surprised at the condition of the model and the still working interior lighting. Subsequently I learned a bit more about the providence of it.</p>\n",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>It has been five years since, in a quest to assemble a specific train, I acquired a model of an East German dining car in the then typical red Mitropa livery. At the time, I didn't really know what I had bought - only that the model had been produced in the GDR. But I was surprised at the condition of the model and the still working interior lighting. Subsequently I learned a bit more about the providence of it.</p>\n\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The model had been made by East German company Schicht, which had been founded in 1947 in Dresden and focused on the production of model railway rolling stock. Interestingly, Schicht was a precursor to Piko. The heritage of Schicht lived on in models made by Sachsenmodelle and later Tillig.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Over the years I picked up a number of different models here and there, a surprising few of them here in Australia. My first few purchases were of varying condition - it's not unusual for certain parts, like buffers and door steps, to be missing, as it doesn't take much to damage those. As I learned more about these models, I started paying attention to their condition. as well. While it's not a dealbreaker, the price I will pay for one of these is commensurate to how well preserved the model is.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The models, made in the 60s and early 70s, before Schicht was rolled into Prefo and then Piko, don't really make you think they could be that old. Their detail level is high, the print quality is astounding, and pretty much the only giveaway is their length, which is scaled to 1:100, something quite common for the time: models were shortened in scale to work better in tighter curves. With the advent of close coupler mechanisms, prototypical length carriages became more viable on small layouts.One little detail I really love is the route signs present on most of the models. With the exception of the CSD sleeping carriage they all show the same route: Berlin - Prague. A great pretext to tell a little story.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>My intent is to run at least some of these in a train. Most of these are equipped with interior lighting, but they use old style incandescent lightbulbs and flicker a LOT on DCC track. Upgrading to LED with a buffer to eliminate flickering will be a must. Thankfully these models are very easy to disassemble. This will be an upcoming project and therefore become my first fully lit train.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>My first acquisition, as mentioned above, was this model of a dining car type Wr 4g of the MITROPA. It was overall in good condition, with working lights and all parts present, and only a minor nick on the roof. The interior is quite detailed for the time, even sporting small table lamps.I have a soft spot for these red dining cars, and none of my East German express trains are complete without one.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":1365,\"sizeSlug\":\"large\",\"linkDestination\":\"media\"} --></p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6212-scaled.jpg\" data-size=\"2560x1440\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6212-scaled-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>Schicht WR 4g Dining Car of the Mitropa</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>Some time later I bought small lot of these models from an Australian seller, all passenger cars of the Deutsche Reichsbahn (DR). At the time I didn't know everything I know now, so these carriages are in very mixed condition. Most buffers and a few of the steps are missing, but at least all the models were clean. There is a good chance I may use the postal car in a train composition, but the rest will live on the shelf. The second dining carriage will probably only serve as a spares donor.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6215.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6215-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>DR 1st Class Passenger Car Type Ame</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6216.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6216-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>DR 2nd Class Passenger Car Type Bme</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6218.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6218-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>DR Postal Car Type m</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6221.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6221-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>DR Dining Car Type WRge</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:gallery {\"linkTo\":\"media\"} --></p>\n<p><!-- /wp:gallery --></p>\n<p><!-- wp:paragraph --></p>\n<p>Another local find was this DR mixed class car type ABme, which I got dirt cheap, but it looks accordingly, with not only a few missing bits but a fair amount of dirt. This one will not run in any train, it's simply too dilapidated for that. But I will use it as a test bed for LED installation and other modifications. I do wish I could find another ABme, but so far I have not been so lucky.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":1370,\"sizeSlug\":\"large\",\"linkDestination\":\"media\"} --></p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6223.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6223-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>DR 1st/2nd Class Passenger Car ABme</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>One might think that's all one is able to get, considering these models are well over 40 years old and would at some point have been shipped halfway across the world. But I would soon learn otherwise. The next local find was two carriages of former Czechoslovak state railway operator CSD, both in very good condition, clean and with all parts present. Looking at these models you'd hardly believe they were made in the 1970s. Both of these will definitely run in a train.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6225.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6225-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>CSD Couchette Car type Bac</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6227.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6227-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>CSD Sleeping Car Type WLAB</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:gallery {\"linkTo\":\"media\"} --></p>\n<p><!-- /wp:gallery --></p>\n<p><!-- wp:paragraph --></p>\n<p>And then, on a trip to Germany, I picked up two more Bme cars from a model railway exchange. Again these were in great condition with working lights and no breakage - much better than the first Bme I got. Which again makes them prime candidates for active duty.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6228.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6228-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>These two carriages</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6230.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6230-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>are not the same</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:gallery {\"linkTo\":\"media\"} --></p>\n<figure class=\"wp-block-gallery has-nested-images columns-default is-cropped\"></figure>\n<p><!-- /wp:gallery --></p>\n<p><!-- wp:paragraph --></p>\n<p>And yet another local find was this Ame, which utterly surprised me. Not only was the model itself in <strong>pristine</strong> condition - it looked like it had never been taken out of the box - but the box was also almost like new. Most of the time, when you do get these models in their boxes, the boxes are quite worn and sometimes tatty. Not so this one - you'd have a hard time believing it was more than ten years old, never mind over 40.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":1375,\"sizeSlug\":\"large\",\"linkDestination\":\"media\"} --></p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6233.jpg\" data-size=\"4032x2268\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/IMG_6233-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>The most pristine Schicht model I ever bought</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>And the most recent addition to this particular collection was another dining carriage, this time of the CSD. I discovered this one at a local second hand trader, and aside from one missing step the model is in good condition. One of the lightbulbs had come loose internally, and since the lighting fixture as a whole looked a bit worn, I removed it entirely. That also gave me the impetus to start thinking about how to upgrade these models to LED lights, a project I will embark on soon.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":1327,\"sizeSlug\":\"large\",\"linkDestination\":\"media\"} --></p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://makingtracks.ah-web.org/media/posts/52/gallery/img_7524.jpg\" data-size=\"2900x1632\"><img loading=\"lazy\" src=\"https://makingtracks.ah-web.org/media/posts/52/gallery/img_7524-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a>\n<figcaption>CSD Dining Car</figcaption>\n</figure>\n</div></div>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>There are still a fair few models out there I'd like to add to the collection, even if they won't run. There are models representing Polish and Hungarian rolling stock, as well as different East German liveries. It may behoove me to also acquire a catalogue of what actually existed. An online find of a later Piko catalogue gives a bit of an idea - it even still uses the same item numbers - but it's by far not the full view.</p>\n<p><!-- /wp:paragraph --></p>",
            "image": "https://makingtracks.ah-web.org/media/posts/52/IMG_6212-scaled.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-01-12T19:45:49+10:00",
            "date_modified": "2025-01-21T16:47:30+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/fun-with-signals/",
            "url": "https://makingtracks.ah-web.org/fun-with-signals/",
            "title": "Fun with Signals",
            "summary": "<p><!-- wp:paragraph --></p>\n<p>Some time ago I took delivery of my first batch of signals. These are generic 3-light signals made in China. They aren't particularly prototypical - the aspects resemble a type of signal used here in Queensland, as well as some European signals. But the looks are very basic. However, for first experiments and wrapping my head around the subject matter, they are more than sufficient.</p>\n",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Some time ago I took delivery of my first batch of signals. These are generic 3-light signals made in China. They aren't particularly prototypical - the aspects resemble a type of signal used here in Queensland, as well as some European signals. But the looks are very basic. However, for first experiments and wrapping my head around the subject matter, they are more than sufficient.</p>\n\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Of course I wanted to control them digitally, like everything else on my layout. As detailed in my post about servos for point control, I am using Arduino-based hardware and software provided by Dutch railway modeller Nico Teering under the name <a href=\"http://www.arcomora.com\" target=\"_blank\" rel=\"noreferrer noopener\">ArCoMoRa</a>. Nico provides the DCCNext, basically a custom Arduino made for controlling model railway accessories. It can be set up with two different software options: MarDec for controlling standard accessories such as lights, point motors and similar; and ArSigDec, which is made specifically for controlling light signals with more complex aspects. Since I was already using MarDec, it made sense to give ArSigDec a whirl.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>LED-based signals are usually equipped with a resistor allowing for them to be used with a specific voltage range. The signals I acquired are meant to be used with 9-12V. Since I was intending to use 5V provided by the DCCNext for the use of LEDs, I was prepared to change the resistor as recommended by the vendor, but a quick test with the signal on 5V showed that that wasn't necessary - the LEDs were bright enough with that voltage.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Setting up the signals on ArSigDec was quite easy. The text-based interface is easy to use and an explanation for all options is always at hand. The software offers a number of standard signals, mainly European ones, which can simply be selected from a database. If that's not sufficient, custom signals with up to 8 LEDs can be defined. Unlike MarDec, you can't set up the decoder ports used by a signal - the first defined signal will use the first available ports starting from port 1, the second signal will use the next available ports, and so on.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>I initially used the built-in UK standard signal with 3 lights and 3 aspects - the closest equivalent to these signals. That all worked fine when only testing with the DCCNext. However, the confusion started when I wanted to use my DCC central to configure and control the signal.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>My new central, the ESU ECoS with built-in touchscreen, allows for the creation of a full track plan. Signals and other objects can be linked in the track plan and fully controlled from there. The ECoS has a limited number of predefined light signal types, as well as a generic light signal with up to 4 aspects. I picked one that was closest to the ones I am using - but the aspects were all wrong. While green was showing on my track plan, the signal actually showed red - and the yellow aspect didn't work at all.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>It took me a minute to wrap my head around this - well, actually I had to sleep over it. The following part of this post dives a bit deeper into the setting up of signal aspects on DCC.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Every DCC accessory gets its own address. Possible addresses are between 1 and 2044. Each accessory address can have two states, often referred to as red and green. This is most understandable when looking at a point, which can be either straight (red) or thrown (green).</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>When setting up a light signal on DCC, each accessory address can handle two aspects - one on red, one on green. A signal is commonly set up with a base address - this address handles the first two configured signal aspects. If a signal has more than two aspects configured, the accessory decoder automatically assigns the next address from the chosen base address. So if the base address is 1, then the first two aspects are handled by that address, the next two are configured under address 2, and so on.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>ArSigDec assigns the aspects as follows:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Aspect 1 = Base address Green</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Aspect 2 = Base address Red</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Aspect 3 = Base address + 1 Green</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Aspect 4 = Base address + 1 Red</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>And so on.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>What I eventually figured out is that the ECoS flips the aspect assignment. For aspect 1, it sends the red command, for aspect 2 the green command, and so on. Unfortunately the aspects themselves and their switching order are fixed in the ECoS and can't be freely configured. For the chosen 3-aspect signal, aspect 1 is the green light, aspect 2 is the red light, aspect 3 is yellow.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>This means the configuration has to be done properly in the signal decoder - which may render some of the available standard signal configurations useless when using the ECoS. Ultimately, the aspects have to be matched like this:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>ECoS aspect 1 --&gt; ArSigDec aspect 2</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>ECoS aspect 2 --&gt; ArSigDec aspect 1</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>ECoS aspect 3 --&gt; ArSigDec aspect 4</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>ECoS aspect 4 --&gt; ArSigDec aspect 3</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>This posed little difficulty once I had figured out this mapping. However, since I am using a signal with three aspects, I had to tinker a bit more, since an ECoS 3-aspect signal and an ArSigDec 3-aspect signal would never match up.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The solution was to create a 3-aspect signal in the ECoS, but a 4-aspect signal in ArSigDec. For the latter, the third aspect becomes a phantom aspect - it will never be active, so I configure it to turn off all LEDs. Aspect 4 is then the actual aspect 3 as shown in the ECoS.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The fun bit came in when I wanted to use the track route functionality of the ECoS to set the signals based on the state of the route. I installed two of these signals on a mainline and siding. There already are two track routes set up in my ECoS track plan, which set both the entry and exit point of the siding to match, so that a train can pass through either the mainline or the siding. All I had to do was to add the desired state of each signal to the track routes - it couldn't be easier.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>In the meantime, I have received my first two signals based on German prototypes. I was able to apply the learnings from the generic signals to these, and it took me considerably little time to set them up and make them operational. They are specced for operation with 10-16V AC or 14-24V DC, but again, 5V make them light up enough for my purposes. The below clip shows the signals in action.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:video {\"id\":1320,\"muted\":true} --></p>\n<figure class=\"wp-block-video\"><video loading=\"lazy\" width=\"702\" height=\"350\" style=\"width: 702px; height: 350px;\" controls=\"controls\" muted=\"\" src=\"https://makingtracks.ah-web.org/wp-content/uploads/2025/01/img_7533-1.mp4\"></video></figure>\n<p><!-- /wp:video --></p>",
            "image": "https://makingtracks.ah-web.org/media/posts/48/img_7530-scaled.jpg",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-01-06T10:03:14+10:00",
            "date_modified": "2025-01-21T16:48:06+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/the-possibly-most-asked-question-by-dcc-beginners-pt-ii-what-to-avoid-doing/",
            "url": "https://makingtracks.ah-web.org/the-possibly-most-asked-question-by-dcc-beginners-pt-ii-what-to-avoid-doing/",
            "title": "The Possibly Most Asked Question by DCC Beginners, Pt II: What to avoid doing",
            "summary": "<p><!-- wp:paragraph --></p>\n<p>If you made it here from <a href=\"https://makingtracks.ah-web.org/the-possibly-most-asked-question-by-dcc-beginners-pt-i-an-attempt-at-answering-it/\">Pt I</a>, and are willing to hear me out a bit more, let's talk about a few things to avoid. And by 'things', I am mainly referring to certain brands that are likely to be mentioned and recommended when someone asks the aforementioned question.</p>\n",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>If you made it here from <a href=\"https://makingtracks.ah-web.org/the-possibly-most-asked-question-by-dcc-beginners-pt-i-an-attempt-at-answering-it/\">Pt I</a>, and are willing to hear me out a bit more, let's talk about a few things to avoid. And by 'things', I am mainly referring to certain brands that are likely to be mentioned and recommended when someone asks the aforementioned question.</p>\n\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Before I get into the meat of that, let me lay a bit of groundwork. A modern DCC system, even at entry level, should have the following features (over and above the general capability to, well, run trains):</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:list --></p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul><!-- wp:list-item -->\n<li>a dedicated programming track output</li>\n</ul>\n</li>\n</ul>\n<p><!-- /wp:list-item --></p>\n<p><!-- wp:list-item --></p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>computer connectivity</li>\n</ul>\n</li>\n</ul>\n<p><!-- /wp:list-item --></p>\n<p><!-- wp:list-item --></p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>at least one usable feedback and extension bus</li>\n</ul>\n</li>\n</ul>\n<p><!-- /wp:list-item --></p>\n<p><!-- wp:list-item --></p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>built-in short-circuit protection.</li>\n</ul>\n</li>\n</ul>\n<p><!-- /wp:list-item --></p>\n<p><!-- /wp:list --></p>\n<p><!-- wp:paragraph --></p>\n<p>A <strong>programming track</strong> is where you position your trains to make changes to its configuration. This may not be front and centre for a beginner, but it won't be long until you need to familiarise yourself with this topic. Having a dedicated programming track is useful because it is configured to use lower voltage, and you avoid accidentally writing config to the wrong train. While it is possible to do programming without a dedicated programming track, it comes with its own drawbacks and restrictions. These days, very few command stations (including entry-level offerings) do not have a dedicated programming track output.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>Computer connectivity</strong> serves a few purposes: firmware or software updates, controlling trains and layouts using external software, or at times providing a more convenient interface for configuring the command central itself. There are very few command stations out there nowadays that don't have a computer connection, usually via USB but sometimes via a network connection.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>A <strong>feedback bus</strong> becomes relevant when you want to use a computer to control and automate your model railway. Specialised software uses feedbacks to determine where on your layout your trains currently are, and uses that information to control them. Going into in-depth detail would make this piece considerably longer than it already is, so let it suffice to say that if the idea of making your trains run across your layout by themselves appeals to you, a usable feedback bus is something you absolutely need. Common options are LocoNet, XPressNet (sometimes known as X-Bus or R-Bus), S88 or CAN. A wide range of accessories is available for these bus systems.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>Short circuit protection</strong> is simply a must. Short circuits can seriously damage your trains and digital gear (and worse). It's not a question of <strong>if</strong> you will experience a short circuit, but <strong>when</strong>. All it takes is for a train to derail over a point. So the digital system needs to detect when a short circuit is happening, and turn off the track power immediately.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>With that out of the way, let's talk about a few digital system brands that you should simply put, avoid, even if recommended to you in the most glorifying way. These brands are: Hornby, MRC/Gaugemaster, and NCE.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Hornby produce the Elite controller, a system that actually looks pretty cool with its colour screen and twin control dials. It ticks all the above boxes in theory - but it is badly supported, unstable, and the entire product line appears to be abandoned. Those are enough reasons to skip past it.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Which might take you to MRC and it UK counterpart Gaugemaster, and you might as well keep skipping. The legacy MRC Prodigy system, sold in Europe under the Gaugemaster brand, is an insular solution lacking a feedback bus, and while it has computer connectivity, it is not supported by most of the software you'll find out there. Gaugemaster have also recently released their own Infinity product line, with the bold claim that it \"delivers not what design engineers think you need but what modellers know it needs\". Which is utterly laughable given the fact that it lacks a feedback bus and <strong>deliberately omits</strong> a computer interface. If all you want is to control trains with a handheld unit, this might suffice, but perish any thought of extensibility or interoperability.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>And that takes us to a brand I am going to single out a bit. I am on record for most of the following, and it continues to be a hill I am willing to die on:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>As a DCC beginner in 2024, steer clear of NCE.</strong></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>North Coast Engineering, or NCE, are a US manufacturer of DCC equipment, including command stations, decoders and all manner of accessories. NCE is also one of the most frequently recommended brands when people ask the question that I elaborated on in Pt 1. So I am going to reiterate what I said before: steer clear of this brand. This is not a joke. If you're a DCC beginner in the year 2024 and beyond, there is <strong>zero </strong>reason for you to consider a digital system made by NCE. Absolutely <strong>none</strong>.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The NCE PowerCab, NCE's entry-level offering since at least 2006, is a particularly egregious case. It is a system stuck on a technical level from 15 years ago, the ecosystem has not seen any significant additions or updates in the same time. By today's standards it is underpowered and lacks features. Yet you are likely to hear people talk about it as if it were the best thing since sliced bread, and tell you it'll be the only thing you'll ever need. Particularly, its fans praise its affordability, ease of use, and extensibility. I am an erstwhile PowerCab user myself, and I can tell you that most of those claims are either vastly exaggerated, or simply bunkum. Fans will also talk about the robustness, reliability and customer support of NCE and its products. You won't hear me argue that particular point, but long-lived, well supported products are not unique to NCE either.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Ease of use is distinctly a matter of taste personally, I found the PowerCab to be neither particularly intuitive, nor easy or fun to use. It's a bulky unit that may not feel nice to hold or operate especially one-handed. It has some idiosyncrasies, such as its locomotive recall function (instead of an actual locomotive database), and its unintuitive point control (indicating 1 and 2 for the state of a point), both of which are likely to throw beginners, and frequently made me scratch my head. Controlling points, accessing decoder functions beyond the number 9, or even basic programming actions, are exercises in memorising sequences of button presses. The 2-line display is of low information density, and the majority of handheld controllers available these days has got much better displays.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><em>Now I should throw in here that, in particular, programming is not the forte of almost any hand controller I've seen in action. It's simply too complex a matter to be able to do with what is effectively a number pad with a few extra buttons. Using an app or dedicated software almost always beats using a handheld controller.</em></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>As far as extensibility goes, the claim that the PowerCab is easy to expand is simply misleading. It's no more or less expandable than the majority of systems out there. You can add boosters, throttles, and certain other devices for the Cab Bus. This is par for the course for virtually any system out there, and many of them uses bus systems that are way easier to configure than the Cab Bus. It is not a system that will easily grow with you - at some point you'll brush up against its limitations, and then it's a case of either spending a lot of money on effectively turning your PowerCab into a PowerPro - or just buying a better system.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The PowerCab lacks <strong>all</strong> of the above mentioned features out of the box. Every single one. You have to pay extra to get any of them. You need a separate gadget to get computer connectivity, another one for a programming track output, and yet another one for good short circuit protection.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>NCE provide a so-called USB interface which connects to their bus and basically acts like a throttle, but it is not as well implemented as a properly integrated connection could be. To get a programming track, you used to have to jury-rig something yourself or buy the Auto_SW, a since discontinued gadget. Recently, NCE have released a new product called the PowerCab Partner, a device which combines the aforementioned USB interface and a dedicated programming track output. I suppose that some credit is due, but again, where has that been for the last ten years or so?</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The PowerCab's short circuit protection is so hopelessly inadequate it shouldn't even be called that. When the PowerCab detects a short circuit, it will go into a start/stop cycle until you physically unplug it. There is no clear indication that a short circuit has been detected. So it can take anyone a few seconds to a) realise what's happening and b) take the appropriate action. This allows for the short circuit to happen repeatedly, increasing the potential for damage. You can buy separate circuit breakers - or go for a system where that isn't necessary.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Now, the PowerCab does have a feedback bus. But you're be very restricted as to what, or rather, how much you can do. NCE produces the Auxiliary Input Unit (AIU), with which feedbacks can be implemented on the PowerCab. However, due to restrictions of the PowerCab specifically, you are limited to a maximum of five AIUs, which gives you at most 70 individual feedbacks. This may be enough for a small layout, but with anything larger or more complex, you're very likely to need more than that. To compare, common feedback bus systems implemented in many other command stations support between 512 and 4096 individual feedbacks.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Lastly, what makes a feedback bus usable is not only its existence, but the availability of feedback modules for it, and in that regard, the Cab Bus is just not up to snuff. Aside from the NCE AIU, no other feedback modules are available for the PowerCab. Meanwhile, if you have a command station with a more widespread bus system, you're able to get matching accessories from other manufacturers, and in some cases, you can even build them yourself.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><em>Note: the high-end NCE offerings revolving around the PowerPro have most of these features built in. Sadly that does not make them any more up-to-date, it just puts them on par with virtually any other offering at most price levels.</em></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Of course this puts a dent into the affordability. By itself the PowerCab may be cheaper, but by the time you've added all of the above, you're almost always better off opting for a different system.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>So to summarise a long read, one more time: if you're starting out with DCC in 2024 or beyond, you have no reason whatsoever to consider the NCE PowerCab as a command central. It has nothing to offer that you can't get elsewhere, and most alternatives have better implementations, better software support, or are simply nicer to use. The only reason to go for NCE is if you're going with your gut and it has tweaked your 'I bet that's fun to use' instinct more than the alternatives.</p>\n<p><!-- /wp:paragraph --></p>",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-01-03T22:27:08+10:00",
            "date_modified": "2025-01-21T13:55:31+10:00"
        },
        {
            "id": "https://makingtracks.ah-web.org/the-possibly-most-asked-question-by-dcc-beginners-pt-i-an-attempt-at-answering-it/",
            "url": "https://makingtracks.ah-web.org/the-possibly-most-asked-question-by-dcc-beginners-pt-i-an-attempt-at-answering-it/",
            "title": "The Possibly Most Asked Question by DCC Beginners, Pt I: An Attempt at answering it",
            "summary": "<p><!-- wp:paragraph --></p>\n<p>So you've decided to get into model railways. Congratulations and welcome to the fold. It's a beautiful hobby that can be practised in many different ways, and all of them are equally valid.</p>\n",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>So you've decided to get into model railways. Congratulations and welcome to the fold. It's a beautiful hobby that can be practised in many different ways, and all of them are equally valid.</p>\n\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>You've probably already read a bit about Digital Command Control, or DCC, and maybe you've already decided to go for it. If you're still wondering if you should, let me make the decision easier for you: yes, you want DCC. Unless you're planning to run one single train on a simple oval around your Christmas tree, DCC can only benefit you. And that's despite its learning curve.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>So now you're well on your way to the next question, and it is possibly one of the most asked questions by any DCC beginner, in any given forum:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>Which digital system should I get?</strong></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Depending on location, place of discourse and other factors, the terms command station, command central, digital system or digital controller may be used interchangeably. We are talking about the device that makes your trains go. Buying one of these is something that should be considered thoroughly, as there are a multitude of options in all price classes, catering to different requirements and tastes. Navigating these options while trying to understand what you need can be all kinds of daunting.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>This question is asked in virtually any model railway related forums with unshakeable regularity, and just as regularly people will instinctively answer with a recommendation for the system they know, like and/or prefer. This is fraught with peril, as different people have different preferences. If all you ever know is a single system, you can't really know if other systems might be more suitable to what the person asking the questions wants to do. Given the different aspects above, it's hard for a beginner to know what you want or don't want to do off the bat - but you probably want to keep your options open until you can confidently make a decision.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Some people will tell you to get what your local club has, or what is most common in your market. A reason often given is that this way you'll have people who know the system and can help you with it. I sincerely invite you to studiously ignore this particular piece of advice. Seriously, disregard it, unless you're planning to spend disproportionately more time in such a club than with your own layout and setup. A club has vastly different requirements from a home layout, their layouts tend to be bigger and cater for multiple simultaneous operators. At home you'll likely be the only or at least main operator, and so you're better off buying what works for you. Few things will sour your model railway hobby more than a command station you actively dislike because it doesn't cater to your preferences.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>From my own experience, the best advice I can give you is: follow your instincts. Look around what's available. Something is bound to catch your eye, and you'll think \"oh, this looks nice\", or \"that seems like it'll be fun to use\". The <strong>best thing</strong> you can do <strong>in that moment</strong> is to home in on that option - research it, figure out the pros and cons, and if there's nothing massively speaking against it - go with it. It may be that you pick an expensive system, but going through cheaper systems one by one to figure out the hard way what you <em>don't</em> like isn't going to be much cheaper in the end. It may be that you pick a system which has a lot of features you might not use initially - that's fine, overkill is deeply underrated. And it's better to have and not need than the other way round.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>When I first looked at getting into DCC, I researched available command stations, and one option immediately jumped out at me: the ESU ECoS. It simply looked like something I wanted to use. But at the time I could neither afford it nor justify the expense. I started out with a Hornby eLink - a small computer interface included with a starter set. It had software included and got me started, but that was about it. I next got an NCE PowerCab, for the main reason that it was the most recommended system out here. As can be read <a href=\"https://makingtracks.ah-web.org/2019/02/17/out-with-the-old-in-with-the-new/\" data-type=\"post\" data-id=\"302\">elsewhere</a>, that didn't last either. My next step was a black box central, the DR5000, which enabled app control. I went with that for quite some time, but due to some ongoing niggling problems as well as my increased dislike for app control, I ultimately decided to throw money at the problem and went with my original preference. And now I ask myself why I hadn't done that from the start.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>I'm not going to go and tell anyone that they should get an ECoS. It's a big upfront expense, and a pricey ecosystem to be in. Some people dislike its fixed, dashboard-like nature and prefer the freedom of movement that comes with a wireless hand-held controller. Many people like controlling their trains with an app - I personally don't, I prefer having my eye on the train and my hand on a physical control dial. Again, here is where everyone has to figure out what works for them, and sometimes it will take several attempts at that. Your first command station does not have to be your last one (but it would be great if it could be).</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>You may ask: which options should I consider? So here is a <strong>non-exhaustive</strong> list of currently available command stations that are modern and expandable, at different price levels, in no particular order (note: some of these links are in German):</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\">Entry Level</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p><a href=\"https://www.digitrax.com/products/starter-sets/dcs52/\">Digitrax Zephyr Express DCS52</a><br><a href=\"https://www.z21.eu/en/products/z21start\">Roco z21 start</a><br><a href=\"https://www.tcsdcc.com/about-lt-50\">TCS LT-50</a><br><a href=\"https://uhlenbrock.de/de_DE/produkte/digizen/i1c3b5c1-001.htm!ArcEntryInfo=0004.19.i1c3b5c1\">Uhlenbrock Daisy II</a><br><a href=\"https://www.piko.de/DE/index.php/de/piko-news/1104-piko-smartcontrol-light-flyer.html\" target=\"_blank\" rel=\"noreferrer noopener\">Piko SmartControl</a></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\">Advanced</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p><a href=\"http://yamorc.de/products/?categories=132\">YaMoRC YD7xxx series</a><br><a href=\"https://tams-online.de/epages/642f1858-c39b-4b7d-af86-f6a1feaca0e4.sf/de_DE/?ObjectPath=/Shops/642f1858-c39b-4b7d-af86-f6a1feaca0e4/Categories/Produkte/Digital/mc2\">Tams MC2</a><br><a href=\"https://www.uhlenbrock.de/de_DE/produkte/newitems/I001F93B-001.htm!ArcEntryInfo=0004.9.I001F93B\" target=\"_blank\" rel=\"noopener noreferrer\">Uhlenbrock Intellibox 3</a><br><a href=\"https://www.digitrax.com/products/command-stations-boosters/dcs240plus/\">Digitrax DCS240</a><br><a href=\"https://www.tcsdcc.com/cs-105\">TCS CS-105</a><br><a href=\"https://www.lenz-elektronik.de/digital-plus/zentrale.php\">Lenz LZV200</a><br><a href=\"https://www.esu.eu/en/products/digital-control/cabcontrol/\">ESU CabControl</a><br><a href=\"https://www.fichtelbahn.de/bidib_uebersicht.html\" target=\"_blank\" rel=\"noreferrer noopener\">Fichtelbahn/BiDiB</a><br><a href=\"https://lokstoredigital.de/\" target=\"_blank\" rel=\"noreferrer noopener\">Lokstoredigital</a></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\">High End</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p><a href=\"https://www.esu.eu/en/products/digital-control/ecos-50210-dcc-system/what-ecos-can-do/\">ESu ECoS 50220</a><br><a href=\"https://www.zimo.at/web2010/products/ErstinfoMX10_EN.htm\">Zimo MX10</a><br><a href=\"https://www.z21.eu/en/products/z21\">Roco Z21</a><br><a href=\"https://www.maerklin.de/en/products/product-information/model-train-control/central-station-3-3-plus\">Märklin CS3</a></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>For Tinkerers</strong></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><a href=\"https://dcc-ex.com/index.html\" target=\"_blank\" rel=\"noreferrer noopener\">DCC-EX</a></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Once again, the best advice I can give you, that anyone should give you, is to use your guts. Figure out what you like, then go from there. If you're going to are fortunate enough to have a model train shop close by where you might be able to try out at least one or two available system, that might help, but not everyone is so lucky, and telling good shops from bad shops is another matter entirely. Your instincts are your best guide. Good luck out there, and if this wasn't enough to keep you busy for a spell, part II goes into a bit more depth and talks about what to avoid.</p>\n<p><!-- /wp:paragraph --></p>",
            "author": {
                "name": "Alex"
            },
            "tags": [
            ],
            "date_published": "2025-01-03T22:24:30+10:00",
            "date_modified": "2025-02-08T17:21:31+10:00"
        }
    ]
}
